Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: If your application is deployed across multiple domains, set the `quarkus.oidc.authentication.cookie-domain` property so that the session cookie is visible to all protected Quarkus services. For example, if you have Quarkus services deployed on the following two domains, then you must set the `quarkus.oidc.authentication.cookie-domain` property to `company.net`.
ja_jp: アプリケーションが複数のドメインにまたがってデプロイされている場合は、セッションクッキー がすべての保護された Quarkus サービスに表示されるように、 `quarkus.oidc.authentication.cookie-domain` プロパティーを設定します。 たとえば、次の 2 つのドメインに Quarkus サービスをデプロイしている場合は、 `quarkus.oidc.authentication.cookie-domain` プロパティーを `company.net` に設定する必要があります。

source: If your application is deployed across multiple domains, set the `quarkus.oidc.authentication.cookie-domain` property so that the session cookie is visible to all protected Quarkus services. For example, if you have Quarkus services deployed on the following two domains, then you must set the `quarkus.oidc.authentication.cookie-domain` property to `company.net`:
ja_jp: アプリケーションが複数のドメインにまたがってデプロイされている場合は、セッションクッキー がすべての保護された Quarkus サービスに表示されるように、 `quarkus.oidc.authentication.cookie-domain` プロパティーを設定します。 たとえば、次の 2 つのドメインに Quarkus サービスをデプロイしている場合は、 `quarkus.oidc.authentication.cookie-domain` プロパティーを `company.net` に設定する必要があります。

source: If your application is running, you can request the endpoint:
ja_jp: アプリケーションが動作している場合は、エンドポイントを要求することができます:

source: If your application needs to accept the tokens with the encrypted claims or the encrypted inner-signed claims, all you have to do is set `smallrye.jwt.decrypt.key.location` pointing to the decryption key.
ja_jp: アプリケーションが暗号化されたクレームや暗号化・内部署名付きクレームを持つトークンを受け入れる必要がある場合は、必要な作業は、復号化キーを指す `smallrye.jwt.decrypt.key.location` を設定することだけです。

source: If your application needs to accept the tokens with the encrypted claims or with the encrypted inner signed claims then all you have to do is to set `smallrye.jwt.decrypt.key.location` pointing to the decryption key.
ja_jp: アプリケーションが、暗号化されたクレームまたは暗号化された内部署名クレームを含むトークンを受け入れる必要がある場合、復号化キーを指す `smallrye.jwt.decrypt.key.location` を設定するだけでかまいません。

source: If your application needs to accept tokens with encrypted claims or encrypted inner-signed claims, simply set the `smallrye.jwt.decrypt.key.location` property to point to the decryption key.
ja_jp: アプリケーションが暗号化されたクレームまたは暗号化された内部署名付きクレームを含むトークンを受け入れる必要がある場合は、復号化キーを指すように `smallrye.jwt.decrypt.key.location` プロパティーを設定するだけです。

source: If your application needs to return non-nominal HTTP codes in error cases, the best is to throw exceptions that will result in the proper HTTP response being sent by the framework using link:{jaxrsapi}/jakarta/ws/rs/WebApplicationException.html[`WebApplicationException`] or any of its subtypes:
ja_jp: もしアプリケーションがエラー時に正規の HTTP コード以外を返す必要がある場合、最適な方法として、フレームワークが link:{jaxrsapi}/jakarta/ws/rs/WebApplicationException.html[`WebApplicationException`] またはその継承型を使用して適切な HTTP レスポンスを送信する結果となる例外を出力します。

source: If your application needs to return non-nominal HTTP codes in error cases, the best is to throw exceptions that will result in the proper HTTP response being sent by the framework using link:{jaxrsapi}/javax/ws/rs/WebApplicationException.html[`WebApplicationException`] or any of its subtypes:
ja_jp: もしアプリケーションがエラー時に正規の HTTP コード以外を返す必要がある場合、最善の方法は、フレームワークが link:{jaxrsapi}/javax/ws/rs/WebApplicationException.html[`WebApplicationException`] またはそのサブタイプを使用して適切な HTTP レスポンスを送信する結果となる例外を投げることです。

source: If your application serves xref:http-reference.adoc[HTTP requests] you can also inject the current `io.vertx.core.http.HttpServerRequest` via the `inject` namespace, e.g. `{inject:vertxRequest.getParam('foo')}`.
ja_jp: アプリケーションが xref:http-reference.adoc[HTTP リクエスト] を提供する場合、`inject` 名前空間を介して現在の `io.vertx.core.http.HttpServerRequest` を注入することもできます (例: `{inject:vertxRequest.getParam('foo')}`)。

source: If your application uses Keycloak authorization configured with link:https://www.keycloak.org/docs/latest/authorization_services/index.html#_policy_js[JavaScript policies] that are deployed in a JAR archive, Dev Services for Keycloak can transfer this archive to the Keycloak container. Use the following properties in `application.properties` to configure the transfer:
ja_jp: アプリケーションが、JAR アーカイブにデプロイされた link:https://www.keycloak.org/docs/latest/authorization_services/index.html#_policy_js[JavaScript ポリシー] で設定された Keycloak 認可を使用する場合、Dev Services for Keycloak はこのアーカイブを Keycloak コンテナーに転送できます。 転送を設定するには、 `application.properties` の次のプロパティーを使用します。

source: If your application uses a client and exposes REST endpoints, please use xref:rest.adoc[Quarkus REST] for the server part.
ja_jp: アプリケーションでクライアントを使用し、RESTエンドポイントを公開する場合は、サーバー部分に xref:rest.adoc[Quarkus REST] を使用してください。

source: If your application uses a client and exposes REST endpoints, please use xref:resteasy-reactive.adoc[RESTEasy Reactive] for the server part.
ja_jp: アプリケーションがクライアントを使用し、REST エンドポイントを公開する場合は、サーバー部分に xref:resteasy-reactive.adoc[RESTEasy Reactive] を使用してください。

source: If your application uses the Reactive stack (quarkus-rest / quarkus-rest-jackson), then the Servlet API is not supported. In this case, adding the quarkus-undertow dependency will not enable servlet injection and will result in runtime errors.
ja_jp: アプリケーションが Reactive スタック (quarkus-rest / quarkus-rest-jackson) を使用している場合、Servlet API はサポートされません。この場合、quarkus-undertow 依存関係を追加してもサーブレットインジェクションは有効にならず、ランタイムエラーが発生します。

source: If your bearer tokens are in a JSON web token (JWT) format, you can use any extensions in the preceding list. Both `quarkus-oidc` and `quarkus-smallrye-jwt` support refreshing the `JsonWebKey` (JWK) set when the OpenID Connect provider rotates the keys. Therefore, if remote token introspection must be avoided or is unsupported by the providers, use `quarkus-oidc` or `quarkus-smallrye-jwt` to verify JWT tokens.
ja_jp: ベアラートークンが JSON Web トークン (JWT) 形式である場合は、上記のリストにある任意のエクステンションを使用できます。 `quarkus-oidc` と `quarkus-smallrye-jwt` はどちらも、OpenID Connect プロバイダーがキーをローテーションするときに設定された `JsonWebKey` (JWK) の更新をサポートしています。 したがって、リモートトークンイントロスペクションを回避する必要がある場合やプロバイダーがこれをサポートしていない場合は、 `quarkus-oidc` または `quarkus-smallrye-jwt` を使用して JWT トークンを検証します。

source: If your bearer tokens must be verified, use `quarkus-oidc`, `quarkus-elytron-security-oauth2`, or `quarkus-smallrye-jwt`.
ja_jp: ベアラートークンを検証する必要がある場合は、 `quarkus-oidc`、 `quarkus-elytron-security-oauth2`、または `quarkus-smallrye-jwt` を使用します。

source: If your chosen session cookie strategy combines tokens and generates a large session cookie value that is greater than 4KB, some browsers might not be able to handle such cookie sizes. This can occur when the ID, access, and refresh tokens are JWT tokens and the selected strategy is `keep-all-tokens` or with ID and refresh tokens when the strategy is `id-refresh-token`. To work around this issue, you can set `quarkus.oidc.token-state-manager.split-tokens=true` to create a unique session token for each token. An alternative solution is to have the tokens saved in the database. For more information, see <<db-token-state-manager>>.
ja_jp: 選択したセッションクッキーストラテジーがトークンを組み合わせ、4 KB を超える大きなセッションクッキー値が生成される場合、一部のブラウザーではそのようなクッキーサイズを処理できない可能性があります。 これは、ID、アクセストークン、およびリフレッシュトークンが JWT トークンで、選択されたストラテジーが `keep-all-tokens` の場合、またはストラテジーが `id-refresh-token` の場合にID トークンとリフレッシュトークンで発生する可能性があります。 この問題を回避するには、 `quarkus.oidc.token-state-manager.split-tokens=true` を設定して、トークンごとに一意のセッショントークンを作成します。 別の解決策として、トークンをデータベースに保存することが挙げられます。 詳細は、<<db-token-state-manager>> を参照してください。

source: If your chosen session cookie strategy combines tokens and generates a session cookie value exceeding 4KB, some browsers might not be able to handle such large cookie sizes. This can occur when the ID, access, and refresh tokens are JWT tokens, and the selected strategy is `keep-all-tokens`, or when the strategy is `id-refresh-token` and only ID and refresh tokens are provided.
ja_jp: 選択したセッション Cookie ストラテジーがトークンを結合し、セッション Cookie の値が 4KB を超える場合、一部のブラウザーはそのような大きな Cookie サイズを処理できない可能性があります。 これは、ID、アクセス、およびリフレッシュトークンが JWT トークンであり、選択されたストラテジーが `keep-all-tokens` である場合、またはストラテジーが `id-refresh-token` であり、ID とリフレッシュトークンのみが提供される場合に発生する可能性があります。

source: If your class doesn't obey these rules (for example by including a method that starts with `get` but is not a setter), you could provide a custom codec for it. Your custom codec will be automatically discovered and registered inside the codec registry. See xref:mongodb.adoc#simplifying-mongodb-client-usage-using-bson-codec[Using BSON codec].
ja_jp: クラスがこれらの規則に従わない場合（例えば、 `get` で始まるがセッターではないメソッドを含む場合）、そのクラスにカスタムコーデックを提供することができます。あなたのカスタム・コーデックは、自動的に検出され、コーデック・レジストリに登録されます。詳しくは、 link:mongodb.html#simplifying-mongodb-client-usage-using-bson-codec[BSONコーデックの使用]をご覧ください。

source: If your class is in a third-party jar, you can do it by using an empty class that will host the `@RegisterForReflection` for it.
ja_jp: クラスがサードパーティの jar にある場合は、そのクラスの `@RegisterForReflection` をホストする空のクラスを使用することで行うことができます。

source: If your classes have only mutable fields, then the `ProtoFactory` annotation is not required, assuming your class has a no arg constructor.
ja_jp: クラスが変更可能なフィールドしかない場合、 `ProtoFactory` アノテーションは必要ありません。あなたのクラスが引数なしのコンストラクタを持っていると仮定します。

source: If your classes have only mutable fields, then the `ProtoFactory` annotation is not required is not required, assuming your class has a no arg constructor
ja_jp: クラスが、変更できるフィールドしか持たない場合、 `ProtoFactory` アノテーションは必要ありません。クラスが引数を持たないコンストラクタを持っている必要があります。

source: If your classpath contains a `persistence.xml` that you want to ignore, set the following configuration property:
ja_jp: クラスパスに無視したい `persistence.xml` がある場合は、 次の設定プロパティーを設定してください:

source: If your cluster requires plain text authentication, you must also provide two more settings: `username` and `password`.
ja_jp: クラスタがプレーンテキスト認証を必要とする場合は、さらに2つの設定を行う必要があります。 `username` と `password` です。

source: If your code makes HTTPS calls (e.g. to a microservice, to an AWS service), you will need to add configuration to the native image, as GraalVM will only include the dependencies when explicitly declared. Quarkus, by default enables this functionality on extensions that implicitly require it. For further information, please consult the xref:native-and-ssl.adoc[Quarkus SSL guide]
ja_jp: コードが hHTTPS (マイクロサービスや AWS サービスなど) を呼び出す場合、GraalVM は明示的に宣言された場合にのみ依存関係を含むため、ネイティブイメージに設定を追加する必要があります。Quarkus は、デフォルトでは、この機能を暗黙的に必要とするエクステンションでこの機能を有効にします。詳細については、xref:native-and-ssl.adoc[Quarkus SSLガイド] を参照してください。

source: If your code makes HTTPS calls, such as to a micro-service (or AWS service), you will need to add configuration to the native image, as GraalVM will only include the dependencies when explicitly declared. Quarkus, by default enables this functionality on extensions that implicitly require it. For further information, please consult the xref:native-and-ssl.adoc[Quarkus SSL guide]
ja_jp: コードがマイクロサービス(またはAWSサービス)などの HTTPS 呼び出しを行う場合、GraalVM は明示的に宣言された場合にのみ依存関係を含むため、ネイティブイメージに設定を追加する必要があります。Quarkus は、デフォルトでは、この機能を暗黙的に必要とするエクステンションでこの機能を有効にします。詳細については、xref:native-and-ssl.adoc[Quarkus SSLガイド] を参照してください。

source: If your delete query does not start with `delete`, we support the following additional forms:
ja_jp: 削除クエリーが `delete` で始まらない場合は、以下の追加の形式をサポートしています:

source: If your endpoint method is delegating calls to another service layer which does not know of JAX-RS, you need a way to turn service exceptions to an HTTP response, and you can do that using the link:{resteasy-reactive-api}/org/jboss/resteasy/reactive/server/ServerExceptionMapper.html[`@ServerExceptionMapper`] annotation on a method, with one parameter of the exception type you want to handle, and turning that exception into a link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestResponse.html[`RestResponse`] (or a link:{mutinyapi}/io/smallrye/mutiny/Uni.html[`Uni<RestResponse<?>>`]):
ja_jp: エンドポイントメソッドが JAX-RS を認識しない別のサービスレイヤーに呼び出しを委任している場合は、サービス例外を HTTP レスポンスに変換する方法が必要であり、メソッドに link:{resteasy-reactive-api}/org/jboss/resteasy/reactive/server/ServerExceptionMapper.html[`@ServerExceptionMapper`] を使用してこれを行うことができます。例外マッパーは処理する例外タイプのパラメーターが 1 つあり、その例外を link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestResponse.html[`RestResponse`] (あるいは link:{mutinyapi}/io/smallrye/mutiny/Uni.html[`Uni<RestResponse<?>>`]) に変換します。

source: If your endpoint method is delegating calls to another service layer which does not know of Jakarta REST, you need a way to turn service exceptions to an HTTP response, and you can do that using the link:{resteasy-reactive-api}/org/jboss/resteasy/reactive/server/ServerExceptionMapper.html[`@ServerExceptionMapper`] annotation on a method, with one parameter of the exception type you want to handle, and turning that exception into a link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestResponse.html[`RestResponse`] (or a link:{mutinyapi}/io/smallrye/mutiny/Uni.html[`Uni<RestResponse<?>>`]):
ja_jp: エンドポイントメソッドが、Jakarta REST を認識していない、別のサービスレイヤーに呼び出しを移譲する場合、HTTP レスポンスにサービスの例外を変換する手段が必要です。また、メソッドに link:{resteasy-reactive-api}/org/jboss/resteasy/reactive/server/ServerExceptionMapper.html[`@ServerExceptionMapper`] アノテーションを付けて、処理する例外タイプのパラメーターを 1 つ指定し、その例外を link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/RestResponse.html[`RestResponse`] (または link:{mutinyapi}/io/smallrye/mutiny/Uni.html[`Uni<RestResponse<?>>`]) に変換します。

source: If your endpoint method needs to accomplish an asynchronous or reactive task before being able to answer, you can declare your method to return the link:{mutinyapi}/io/smallrye/mutiny/Uni.html[`Uni`] type (from https://smallrye.io/smallrye-mutiny/[Mutiny]), in which case the current HTTP request will be automatically suspended after your method, until the returned link:{mutinyapi}/io/smallrye/mutiny/Uni.html[`Uni`] instance resolves to a value, which will be mapped to a response exactly according to the previously described rules:
ja_jp: エンドポイントメソッドがレスポンスする前に非同期またはリアクティブタスクを実行する必要がある場合は、メソッドを宣言して (https://smallrye.io/smallrye-mutiny/[Mutiny] の) ink:{mutinyapi}/io/smallrye/mutiny/Uni.html[`Uni`] 型を返すことができます。この場合、現在の HTTP リクエストはメソッドの後で、返された link:{mutinyapi}/io/smallrye/mutiny/Uni.html[`Uni`] インスタンスが値に解決され、前述のルールに従って正確にレスポンスにマッピングされるまで自動的に一時停止されます。

source: If your environment does not support Docker, you will need to spin up an Infinispan Server manually, or connect to an already running server.
ja_jp: Dockerに対応していない環境では、Infinispan Serverを手動で立ち上げるか、既に稼働しているサーバーに接続する必要があります。

source: If your extension defines annotations or interfaces that mark beans needing to be processed, you can locate these beans using the Jandex API, a Java annotation indexer and offline reflection library. The following `TestProcessor#scanForBeans` method shows how to find the beans annotated with our `@TestAnnotation` that also implement the `IConfigConsumer` interface:
ja_jp: エクステンションが、処理が必要なBeanをマークするアノテーションやインターフェースを定義している場合、Javaアノテーション・インデクサーとオフライン・リフレクション・ライブラリであるJandex APIを使って、これらのBeanを見つけることができます。以下の `TestProcessor#scanForBeans` メソッドは、 `IConfigConsumer` インターフェースも実装している `@TestAnnotation` でアノテーションされたBeanを見つける方法を示しています。

source: If your extension provides APIs for connecting to an external service, it's a good idea to provide a dev service implementation.
ja_jp: エクステンションが外部サービスに接続するためのAPIを提供する場合、devサービスの実装を提供するのはよい考えです。

source: If your extension provides APIs for connecting to an external service, it's a good idea to provide a xref:dev-services.adoc[Dev Service] implementation.
ja_jp: エクステンションが外部サービスに接続するための API を提供する場合は、xref:dev-services.adoc[Dev Service] 実装を提供することを推奨します。

source: If your file does not use one of these extensions, you must set the format by using the following properties:
ja_jp: ファイルでこれらの拡張子が使用されていない場合は、次のプロパティーを使用して形式を設定する必要があります。

source: If your identity provider does not implement OpenID Connect but only the legacy XML-based SAML2.0 SSO protocol, then Quarkus cannot be used as a SAML 2.0 adapter, similarly to how `quarkus-oidc` is used as an OIDC adapter.
ja_jp: アイデンティティープロバイダーが OpenID Connect を実装しておらず、従来の XML ベースの SAML2.0 SSO プロトコルのみを実装している場合、 `quarkus-oidc` を OIDC アダプターとして使用する場合と同じように、Quarkus を SAML 2.0 アダプターとして使用することはできません。

source: If your method is annotated with `@Transactional`, it will be considered _blocking_ automatically, even if the method is not annotated with `@Blocking`.
ja_jp: メソッドに `@Transactional` アノテーションが付けられている場合、メソッドに `@Blocking` アノテーションが付けられていなくても、自動的に _blocking_ と見なされます。

source: If your method returns a `Uni` or `CompletionStage`, you need to add the `@NonBlocking` annotation:
ja_jp: メソッドが `Uni` または `CompletionStage` を返す場合は、 `@NonBlocking` アノテーションを追加する必要があります。

source: If your project is already configured to use other annotation processors, you will need to additionally add the Panache annotation processor:
ja_jp: プロジェクトがすでに他のアノテーションプロセッサーを使用するように設定されている場合、追加でPanacheアノテーションプロセッサーを追加する必要があります:

source: If your project is correctly set up, you should now be able to compile it without errors, and you should see the generated code in the `target/generated-sources/annotations` directory (if you are using Maven). It's not required to get familiar with the generated code though, as it is mostly internal machinery to interact with the database.
ja_jp: プロジェクトが正しくセットアップされていれば、エラーなくコンパイルできるはずです。また、生成されたコードが `target/generated-sources/annotations` ディレクトリに存在する筈です（Maven を使用している場合）。生成されたコードは、ほとんどがデータベースとやりとりするための内部処理なので、慣れる必要はないでしょう。

source: If your query does not start with `{`, we will consider it a PanacheQL query:
ja_jp: `{` で始まらないクエリは、PanacheQL クエリとみなします。

source: If your select query does not start with `from`, `select` or `with`, we support the following additional forms:
ja_jp: セレクトクエリが `from` , `select` , `with` で始まらない場合、以下の追加形式をサポートします：

source: If your select query does not start with `from`, we support the following additional forms:
ja_jp: 選択クエリーが `from` で始まらない場合は、以下の追加の形式をサポートしています:

source: If your service has an admin console, it's a nice pattern to publish a link to it in the Dev UI. With the old Dev Services model, you might customise your extensions's card with code something like this:
ja_jp: サービスに管理コンソールがある場合、Dev UI でそのリンクを公開するのは良いパターンです。旧 Dev Services モデルでは、次のようなコードでエクステンションのカードをカスタマイズしていたかもしれません。

source: If your service implementation logic is blocking (use blocking I/O for example), annotate your method with `@Blocking`. The `io.smallrye.common.annotation.Blocking` annotation instructs the framework to invoke the annotated method on a worker thread instead of the I/O thread (event-loop).
ja_jp: サービスの実装ロジックがブロッキングである (例えば、ブロッキング I/O を使用する) 場合には、メソッドに `@Blocking` をアノテーションします。 `io.smallrye.common.annotation.Blocking` アノテーションは、I/O スレッド (イベントループ) の代わりにワーカースレッドでアノテーションされたメソッドを呼び出すようにフレームワークに指示します。

source: If your tests are dependent on context propagation, you can configure the in-memory connector channels with the `run-on-vertx-context` attribute to dispatch events, including messages and acknowledgements, on a Vert.x context. Alternatively you can switch this behaviour using the `InMemorySource#runOnVertxContext` method.
ja_jp: テストがコンテキストの伝播に依存している場合は、 `run-on-vertx-context` 属性を使用して in-memory コネクターチャネルを設定し、 メッセージや確認応答などのイベントを Vert.x コンテキストにディスパッチできます。 あるいは、 `InMemorySource#runOnVertxContext` メソッドを使用して、この動作を切り替えることもできます。

source: If your tests are dependent on context propagation, you can configure the in-memory connector channels with `run-on-vertx-context` attribute to dispatch events, including messages and acknowledgements, on a Vert.x context. Alternatively you can switch this behaviour using the `InMemorySource#runOnVertxContext` method.
ja_jp: テストがコンテキストの伝播に依存している場合は、`run-on-vertx-context` 属性を使用して in-memory コネクターチャネルを設定し、メッセージや確認応答などのイベントを Vert.x コンテキストにディスパッチできます。 あるいは、`InMemorySource#runOnVertxContext` メソッドを使用して、この動作を切り替えることもできます。

source: If your transaction involves non-datasource resources, be aware that they might not support XA transactions or might require additional configuration.
ja_jp: トランザクションにデータソース以外のリソースが含まれる場合は、そのリソースで XA トランザクションがサポートされていない可能性や、追加の設定が必要になる可能性があることに注意してください。

source: If your update query does not start with `update`, we support the following additional forms:
ja_jp: 更新クエリーが `update` で始まらない場合は、以下の追加の形式をサポートしています:

source: If, during the current user request, it is determined that the current ID token will expire within the `quarkus.oidc.token.refresh-token-time-skew`, then it is refreshed, and a new session cookie is created. This property should be set to a value less than the ID token's lifespan; the closer it is to that lifespan, the more often the ID token is refreshed.
ja_jp: 現在のユーザーリクエスト中に、現在の ID トークンが `quarkus.oidc.token.refresh-token-time-skew` 内に期限切れになると判断された場合、トークンは更新され、新しいセッション Cookie が作成されます。 このプロパティーは、ID トークンの有効期間よりも短い値に設定する必要があります。この有効期間の値に近いほど、ID トークンの更新頻度が高くなります。

source: If, for any reason, additional permissions are required either by the init container or the job, they can be configured with the xref:deploying-to-kubernetes.adoc#generating-rbac-resources[Kubernetes RBAC configuration].
ja_jp: 何らかの理由で、initコンテナまたはジョブのいずれかに追加のパーミッションが必要な場合は、 xref:deploying-to-kubernetes.adoc#generating-rbac-resources[KubernetesのRBAC設定] で設定できます。

source: If, for example, a custom serializer named `FooSerializer` for type `com.example.Foo` needs to be registered with JSON-B, the addition of a bean like the following would suffice:
ja_jp: たとえば、 `FooSerializer` という名前のカスタムシリアライザーを `com.example.Foo` タイプで JSON-B で登録する必要がある場合、以下のような Bean を追加すれば十分です。

source: If, for some reason, adding Hibernate Search annotations to entities is not possible, mapping can be applied programmatically instead. Programmatic mapping is configured through the `ProgrammaticMappingConfigurationContext` that is exposed via a mapping configurer (`HibernateOrmSearchMappingConfigurer`).
ja_jp: 何らかの理由で Hibernate Search アノテーションをエンティティーに追加できない場合は、 代わりにプログラムでマッピングを適用することができます。 プログラムによるマッピングは、 `ProgrammaticMappingConfigurationContext` を通じて設定され、 マッピング Configurer (`HibernateOrmSearchMappingConfigurer`) を介して公開されます。

source: Ignored: starts with `"`.
ja_jp: 無視対象: `"` で開始

source: Ignored: starts with `{`.
ja_jp: 無視対象: `{` で開始

source: Ignored: starts with whitespace.
ja_jp: 無視対象: 空白で開始

source: Ignoring Class-Level Interceptor Bindings for Methods and Constructors
ja_jp: メソッドとコンストラクターのクラスレベルのインターセプターバインディングを無視する

source: Ignoring Services
ja_jp: サービスの無視

source: Ignoring endpoints
ja_jp: エンドポイントの無視

source: Image Names
ja_jp: イメージ名

source: Image type can be configured using
ja_jp: 次のようにイメージの種類を設定することができます。

source: Imagine for instance that an application contains a bean named `Tracer`, which needs to be do nothing when in tests or dev-mode, but works in its normal capacity for the production artifact. An elegant way to create such beans is the following:
ja_jp: たとえば、アプリケーションが `Tracer` という名前の Bean を含んでいるとします。この Bean は、テストや開発モードでは何もする必要はありませんが、本番の成果物に対しては通常の能力で動作します。このような Bean を作成する洗練された方法は以下の通りです。

source: Imagine for instance that an application contains a bean named `Tracer`, which needs to do nothing when in tests or in dev mode, but works in its normal capacity for the production artifact. An elegant way to create such beans is the following:
ja_jp: たとえば、アプリケーションが `Tracer` という名前の Bean を含んでいるとします。この Bean は、テストや開発モードでは何もする必要はありませんが、本番の成果物に対しては通常の能力で動作します。このような Bean を作成する洗練された方法は以下の通りです。
